In [82]:
import pandas as pd
import numpy as np
import datetime as dt

In [83]:
#inserciond de datasets
df1=pd.read_csv("Datasets/olist_closed_deals_dataset.csv")
df2=pd.read_csv("Datasets/olist_customers_dataset.csv",dtype={"customer_zip_code_prefix": str})
df3=pd.read_csv("Datasets/olist_geolocation_dataset.csv")
df4=pd.read_csv("Datasets/olist_marketing_qualified_leads_dataset.csv")
df5=pd.read_csv("Datasets/olist_order_items_dataset.csv")
df6=pd.read_csv("Datasets/olist_order_payments_dataset.csv")
df7=pd.read_csv("Datasets/olist_order_reviews_dataset.csv")
df8=pd.read_csv("Datasets/olist_orders_dataset.csv")
df9=pd.read_csv("Datasets/olist_products_dataset.csv")
df10=pd.read_csv("Datasets/olist_sellers_dataset.csv",dtype={"seller_zip_code_prefix": str})
df11=pd.read_csv("Datasets/product_category_name_translation.csv")

## ETL olist_closed_deals_dataset

In [84]:
dfclosed=df1

In [85]:
dfclosed.drop(columns=["lead_behaviour_profile","has_company","has_gtin","average_stock","business_type","declared_product_catalog_size","declared_monthly_revenue"],axis=1,inplace=True)

In [86]:
dfclosed["won_date"]=pd.to_datetime(dfclosed["won_date"],format="%Y-%m-%d %H:%M:%S")

In [87]:
dfclosed.isna().sum()

mql_id              0
seller_id           0
sdr_id              0
sr_id               0
won_date            0
business_segment    1
lead_type           6
dtype: int64

In [88]:
dfclosed.fillna("SIN DATO",inplace=True)

In [89]:
dfclosed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 842 entries, 0 to 841
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   mql_id            842 non-null    object
 1   seller_id         842 non-null    object
 2   sdr_id            842 non-null    object
 3   sr_id             842 non-null    object
 4   won_date          842 non-null    datetime64[ns]
 5   business_segment  842 non-null    object
 6   lead_type         842 non-null    object
dtypes: datetime64[ns](1), object(6)
memory usage: 46.2+ KB

In [90]:
dfclosed.to_csv("datasetsout/olist_closed_deals_dataset.csv")

## ETL olistcustomers_dataset

In [91]:
dfcostumers=df2

In [92]:
dfcostumers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               99441 non-null  object
 1   customer_unique_id        99441 non-null  object
 2   customer_zip_code_prefix  99441 non-null  object
 3   customer_city             99441 non-null  object
 4   customer_state            99441 non-null  object
dtypes: object(5)
memory usage: 3.8+ MB

In [93]:
dfcostumers.drop(columns=["customer_city","customer_state"],axis=1,inplace=True)

In [94]:
dfcostumers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 3 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               99441 non-null  object
 1   customer_unique_id        99441 non-null  object
 2   customer_zip_code_prefix  99441 non-null  object
dtypes: object(3)
memory usage: 2.3+ MB

In [95]:
dfcostumers.to_csv("datasetsout/olist_customers_dataset.csv")

## ETL olist_marketing_qualified_leads_dataset

In [96]:
dfmarketing=df4

In [97]:
dfmarketing.head()

,mql_id,first_contact_date,landing_page_id,origin
0,dac32acd4db4c29c230538b72f8dd87d,2018-02-01,88740e65d5d6b056e0cda098e1ea6313,social
1,8c18d1de7f67e60dbd64e3c07d7e9d5d,2017-10-20,007f9098284a86ee80ddeb25d53e0af8,paid_search
2,b4bc852d233dfefc5131f593b538befa,2018-03-22,a7982125ff7aa3b2054c6e44f9d28522,organic_search
3,6be030b81c75970747525b843c1ef4f8,2018-01-22,d45d558f0daeecf3cccdffe3c59684aa,email
4,5420aad7fec3549a85876ba1c529bd84,2018-02-21,b48ec5f3b04e9068441002a19df93c6c,organic_search

In [98]:
dfmarketing["first_contact_date"]=pd.to_datetime(dfmarketing["first_contact_date"],format="%Y-%m-%d %H:%M:%S")

In [99]:
dfmarketing.head()

,mql_id,first_contact_date,landing_page_id,origin
0,dac32acd4db4c29c230538b72f8dd87d,2018-02-01,88740e65d5d6b056e0cda098e1ea6313,social
1,8c18d1de7f67e60dbd64e3c07d7e9d5d,2017-10-20,007f9098284a86ee80ddeb25d53e0af8,paid_search
2,b4bc852d233dfefc5131f593b538befa,2018-03-22,a7982125ff7aa3b2054c6e44f9d28522,organic_search
3,6be030b81c75970747525b843c1ef4f8,2018-01-22,d45d558f0daeecf3cccdffe3c59684aa,email
4,5420aad7fec3549a85876ba1c529bd84,2018-02-21,b48ec5f3b04e9068441002a19df93c6c,organic_search

In [100]:
dfmarketing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8000 entries, 0 to 7999
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   mql_id              8000 non-null   object
 1   first_contact_date  8000 non-null   datetime64[ns]
 2   landing_page_id     8000 non-null   object
 3   origin              7940 non-null   object
dtypes: datetime64[ns](1), object(3)
memory usage: 250.1+ KB

In [101]:
dfmarketing.isnull().sum()

mql_id                 0
first_contact_date     0
landing_page_id        0
origin                60
dtype: int64

In [102]:
dfmarketing.fillna("SIN DATO",inplace=True)

In [103]:
dfmarketing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8000 entries, 0 to 7999
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   mql_id              8000 non-null   object
 1   first_contact_date  8000 non-null   datetime64[ns]
 2   landing_page_id     8000 non-null   object
 3   origin              8000 non-null   object
dtypes: datetime64[ns](1), object(3)
memory usage: 250.1+ KB

In [104]:
dfmarketing.to_csv("datasetsout/olist_marketing_qualified_leads_dataset.csv")

## ETL olist_order_items_dataset.csv

In [105]:
dfitems=df5

In [106]:
dfitems.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112650 entries, 0 to 112649
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   order_id             112650 non-null  object
 1   order_item_id        112650 non-null  int64
 2   product_id           112650 non-null  object
 3   seller_id            112650 non-null  object
 4   shipping_limit_date  112650 non-null  object
 5   price                112650 non-null  float64
 6   freight_value        112650 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 6.0+ MB

In [107]:
dfitems["shipping_limit_date"]=pd.to_datetime(dfitems["shipping_limit_date"],format="%Y-%m-%d %H:%M:%S")

In [108]:
dfitems.head()

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14

In [109]:
dfitems.to_csv("datasetsout/olist_order_items_dataset.csv")

## ETL olist_order_payments_dataset.csv

In [110]:
dfpayments=df6

In [111]:
dfpayments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  object
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  object
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ MB

In [112]:
merged_inner = pd.merge(left=dfitems,right=dfpayments, left_on='order_id', right_on='order_id')

In [113]:
merged_inner.head()

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value,payment_sequential,payment_type,payment_installments,payment_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29,1,credit_card,2,72.19
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93,1,credit_card,3,259.83
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87,1,credit_card,5,216.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79,1,credit_card,2,25.78
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14,1,credit_card,3,218.04

In [114]:
merged_inner[(merged_inner["order_item_id"]>1) & (merged_inner["payment_sequential"]>1)]

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value,payment_sequential,payment_type,payment_installments,payment_value
1760,03ecec245220b63fd7f68c1737ba99ba,2,059ca09d32720d9adce3ae12e181339d,620c87c171fb2a6dd6e8bb4dec959fc6,2018-06-15 20:23:08,109.9,18.05,2,voucher,1,56.39
1785,03f51c9adce893f63936c5146701aa2f,2,88e59749c8b39fd1a9b7458147e0dc62,594f9aaa48e5bf431f011ddc5669b0d5,2018-06-20 17:20:26,155.9,45.01,2,voucher,1,31.25
1874,041f09bbcd85d178903f5bb71f11a02e,2,386486367c1f9d4f587a8864ccb6902b,cca3071e3e9bb7d12640c9fbe2301306,2017-05-04 11:55:17,109.9,29.70,2,credit_card,8,141.37
1880,0420dbc50fc554e303e4b2d6b39063f6,2,84a87daa85c8b432d90bc1baa0cb4388,aafe36600ce604f205b86b5084d3d767,2017-11-23 20:31:15,59.9,15.94,2,voucher,1,193.73
1882,0420dbc50fc554e303e4b2d6b39063f6,3,fdba6f37e0258dbca54eb0ed8b293ae0,aafe36600ce604f205b86b5084d3d767,2017-11-23 20:31:15,59.9,14.72,2,voucher,1,193.73
...,...,...,...,...,...,...,...,...,...,...,...
117237,ff1f8f328e5a59ac754240b6dd31bcb4,2,e7a6f33d382bca6fa19f52ff13e440bd,4a3ca9315b744ce9f8e9374361493884,2017-08-16 16:25:17,74.0,12.02,3,voucher,1,142.58
117238,ff1f8f328e5a59ac754240b6dd31bcb4,2,e7a6f33d382bca6fa19f52ff13e440bd,4a3ca9315b744ce9f8e9374361493884,2017-08-16 16:25:17,74.0,12.02,4,voucher,1,26.03
117239,ff1f8f328e5a59ac754240b6dd31bcb4,3,e7a6f33d382bca6fa19f52ff13e440bd,4a3ca9315b744ce9f8e9374361493884,2017-08-16 16:25:17,74.0,12.02,2,voucher,1,78.28
117241,ff1f8f328e5a59ac754240b6dd31bcb4,3,e7a6f33d382bca6fa19f52ff13e440bd,4a3ca9315b744ce9f8e9374361493884,2017-08-16 16:25:17,74.0,12.02,3,voucher,1,142.58
117242,ff1f8f328e5a59ac754240b6dd31bcb4,3,e7a6f33d382bca6fa19f52ff13e440bd,4a3ca9315b744ce9f8e9374361493884,2017-08-16 16:25:17,74.0,12.02,4,voucher,1,26.03

In [115]:
merged_inner[merged_inner["order_id"]=="03ecec245220b63fd7f68c1737ba99ba"]

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value,payment_sequential,payment_type,payment_installments,payment_value
1758,03ecec245220b63fd7f68c1737ba99ba,1,d8cabd83757ecf48a7d2628dee9135c1,fe2032dab1a61af8794248c8196565c9,2018-06-13 20:23:08,189.0,58.78,2,voucher,1,56.39
1759,03ecec245220b63fd7f68c1737ba99ba,1,d8cabd83757ecf48a7d2628dee9135c1,fe2032dab1a61af8794248c8196565c9,2018-06-13 20:23:08,189.0,58.78,1,credit_card,2,319.34
1760,03ecec245220b63fd7f68c1737ba99ba,2,059ca09d32720d9adce3ae12e181339d,620c87c171fb2a6dd6e8bb4dec959fc6,2018-06-15 20:23:08,109.9,18.05,2,voucher,1,56.39
1761,03ecec245220b63fd7f68c1737ba99ba,2,059ca09d32720d9adce3ae12e181339d,620c87c171fb2a6dd6e8bb4dec959fc6,2018-06-15 20:23:08,109.9,18.05,1,credit_card,2,319.34

In [116]:
dfitems[dfitems["order_id"]=="03ecec245220b63fd7f68c1737ba99ba"]

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
1713,03ecec245220b63fd7f68c1737ba99ba,1,d8cabd83757ecf48a7d2628dee9135c1,fe2032dab1a61af8794248c8196565c9,2018-06-13 20:23:08,189.0,58.78
1714,03ecec245220b63fd7f68c1737ba99ba,2,059ca09d32720d9adce3ae12e181339d,620c87c171fb2a6dd6e8bb4dec959fc6,2018-06-15 20:23:08,109.9,18.05

In [117]:
dfpayments[dfpayments["order_id"]=="03ecec245220b63fd7f68c1737ba99ba"]

,order_id,payment_sequential,payment_type,payment_installments,payment_value
4151,03ecec245220b63fd7f68c1737ba99ba,2,voucher,1,56.39
22318,03ecec245220b63fd7f68c1737ba99ba,1,credit_card,2,319.34

In [118]:
dfprueba=dfpayments.groupby(['order_id']).sum()

In [119]:
dfprueba.head()

,payment_sequential,payment_installments,payment_value
order_id,,,
00010242fe8c5a6d1ba2dd792cb16214,1,2,72.19
00018f77f2f0320c557190d7a144bdd3,1,3,259.83
000229ec398224ef6ca0657da4fc703e,1,5,216.87
00024acbcdf0a6daa1e931b038114c75,1,2,25.78
00042b26cf59d7ce69dfabb4e55b4fd9,1,3,218.04

In [120]:
dfprueba[dfprueba.index=="03ecec245220b63fd7f68c1737ba99ba"]

,payment_sequential,payment_installments,payment_value
order_id,,,
03ecec245220b63fd7f68c1737ba99ba,3,3,375.73

In [121]:
dfpayments.to_csv("datasetsout/olist_order_payments_dataset.csv")

## ETL olist_order_reviews_dataset

In [122]:
dfreviews=df7

In [123]:
dfreviews.to_csv("datasetsout/olist_order_reviews_dataset.csv")

## ETL olist_orders_dataset

In [124]:
dforder=df8

In [125]:
dforder.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00

In [126]:
dforder.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 8 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   order_id                       99441 non-null  object
 1   customer_id                    99441 non-null  object
 2   order_status                   99441 non-null  object
 3   order_purchase_timestamp       99441 non-null  object
 4   order_approved_at              99281 non-null  object
 5   order_delivered_carrier_date   97658 non-null  object
 6   order_delivered_customer_date  96476 non-null  object
 7   order_estimated_delivery_date  99441 non-null  object
dtypes: object(8)
memory usage: 6.1+ MB

In [127]:
dforder["order_purchase_timestamp"]=pd.to_datetime(dforder["order_purchase_timestamp"],format="%Y-%m-%d %H:%M:%S")
dforder["order_approved_at"]=pd.to_datetime(dforder["order_approved_at"],format="%Y-%m-%d %H:%M:%S")
dforder["order_delivered_carrier_date"]=pd.to_datetime(dforder["order_delivered_carrier_date"],format="%Y-%m-%d %H:%M:%S")
dforder["order_delivered_customer_date"]=pd.to_datetime(dforder["order_delivered_customer_date"],format="%Y-%m-%d %H:%M:%S")
dforder["order_estimated_delivery_date"]=pd.to_datetime(dforder["order_estimated_delivery_date"],format="%Y-%m-%d %H:%M:%S")

In [128]:
dforder.to_csv("datasetsout/olist_orders_dataset.csv")

## ETL olist_sellers_dataset

In [129]:
dfsellers=df10

In [130]:
dfsellers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3095 entries, 0 to 3094
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   seller_id               3095 non-null   object
 1   seller_zip_code_prefix  3095 non-null   object
 2   seller_city             3095 non-null   object
 3   seller_state            3095 non-null   object
dtypes: object(4)
memory usage: 96.8+ KB

In [131]:
dfsellers.drop(columns=["seller_city","seller_state"],axis=1,inplace=True)

In [132]:
dfsellers['seller_zip_code_prefix'] = dfsellers['seller_zip_code_prefix'].astype('string')

In [133]:
dfsellers.head()

                          seller_id seller_zip_code_prefix
0  3442f8959a84dea7ee197c632cb2df15                  13023
1  d1b65fc7debc3361ea86b5f14c68d2e2                  13844
2  ce3ad9de960102d0677a81f5d0bb7b2d                  20031
3  c0f3eea2e14555b6faeea3dd58c1b1c3                  04195
4  51a04a8a6bdcb23deccc82b0b80742cf                  12914

In [134]:
dfsellers.to_csv("datasetsout/olist_sellers_dataset.csv")

## ETL olist_products_dataset.csv

In [135]:
dfproducts=df9

In [136]:
dfproducts.drop(columns=["product_name_lenght","product_description_lenght"],axis=1,inplace=True)

In [137]:
dfproducts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32951 entries, 0 to 32950
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   product_id             32951 non-null  object
 1   product_category_name  32341 non-null  object
 2   product_photos_qty     32341 non-null  float64
 3   product_weight_g       32949 non-null  float64
 4   product_length_cm      32949 non-null  float64
 5   product_height_cm      32949 non-null  float64
 6   product_width_cm       32949 non-null  float64
dtypes: float64(5), object(2)
memory usage: 1.8+ MB

In [138]:
dfproducts.to_csv("datasetsout/olist_products_dataset.csv")

## ETL product_category_name_translation.csv

In [139]:
dfproductcategory=df11

In [140]:
dfproductcategory.to_csv("datasetsout/product_category_name_translation.csv")